# 학번 : 12202097
# 성명 : 정상혁

# 2024년 2월 16일 자료구조&알고리즘 테스트
# 문제 : 담당 교수의 데모화면과 맨 아래 출력결과를 참고하여 아래 코드의 pass 부분을 완성하시오.
# 조건
# 1) 총 6개의 도시를 최소 비용으로 연결 하려고 한다. 각 도시의 연결선(간선)에는 도로 건설 비용과 공사 담당 포켓몬스터가 있다.
# 2) 정렬 사용시 사용자 정의 정렬을 사용한다. (built-in 정렬 사용 시 감점 처리)
# 3) my_sort는 최선의 경우 : O(n log n), 평균적인 경우 : O(n log n), 최악의 경우 : O(n²) 시간 복잡도를 갖는다.
# 4) ur_sort는 최선의 경우 : O(n²), 평균적인 경우 : O(n²), 최악의 경우 : O(n²) 시간 복잡도를 갖는다.
# 5) mst 함수는 2d list와 int 값을 튜플 형태로 반환한다
# 6) 정렬에 걸린 시간을 출력 할 수 있어야 한다
# 7) 최종 연결 그래프와 최소 비용을 출력 한다

import time  # time.time()은 현재 시간을 초 단위로 리턴 (float type)


class Pokemon:
    def __init__(self, name, power):
        self.name = name  # 이름
        self.power = power  # 전투력

    def __repr__(self):
        return self.name


def my_sort(arr):
    def qSort(arr, start, end):
        if end <= start:
            return

        low = start
        high = end

        pivot = arr[(low + high) // 2][2]
        while low <= high:
            while arr[low][2] < pivot:
                low += 1
            while arr[high][2] > pivot:
                high -= 1
            if low <= high:
                arr[low], arr[high] = arr[high], arr[low]
                low, high = low + 1, high - 1

        mid = low

        qSort(arr, start, mid - 1)
        qSort(arr, mid, end)

    qSort(arr, 0, len(arr)- 1)


def ur_sort(arr):
    n = len(arr)
    for end in range(1, n):
        for cur in range(end, 0, -1):
            if arr[cur -1][2] > arr[cur][2]:
                arr[cur-1], arr[cur] = arr[cur], arr[cur -1]
    return arr


def mst(graph):  # 이 함수 안에서 필요에 따라 ur_sort 또는 my_sort를 호출하고 정렬 시간을 출력한다
    graph_2d_arr = [[0 for _ in range(6)] for _ in range(6)]
    for i in range(6):
        graph_2d_arr[graph[i][0]][graph[i][1]] = graph[i][2]

    def find(g, findVtx):
        stack = []
        visited = []

        current = 0
        stack.append(current)
        visited.append(current)

        while(len(stack) != 0):
            next = None
            for vertex in range(6):
                if graph_2d_arr[current][vertex] != 0:
                    if vertex in visited:
                        pass
                    else:
                        next = vertex
                        break
                if next != None:
                    current = next
                    stack. append(current)


    graph = ur_sort(graph)
    #graph = my_sort(graph)

    index = 0
    while len(graph) > 5:
        start = graph[index][0]
        end = graph[index][1]
        save_cost = graph[index][2]

        graph_2d_arr[start][end] = 0

        startYN = dfs(graph_2d_arr, start)









# 그래프 정의 [u, v, w, p] 쌍으로 u와 v는 도시 정점, w는 도로 건설 비용, p는 포켓몬 객체
graph = [
    [0, 1, 10, Pokemon('피카츄', 55)],
    [0, 2, 6, Pokemon('꼬부기', 45)],
    [0, 3, 5, Pokemon('이상해씨', 41)],
    [1, 3, 15, Pokemon('뮤', 65)],
    [2, 3, 4, Pokemon('파이리', 57)],
    [1, 4, 7, Pokemon('개굴닌자', 73)],
    [2, 4, 8, Pokemon('리자몽', 69)],
    [3, 4, 9, Pokemon('라이츄', 64)],
    [4, 5, 11, Pokemon('잉어킹', 19)],
    [3, 5, 13, Pokemon('갸라도스', 75)]
]
num_nodes = 6
r, c = mst(graph)
print(f"MST: {r}\nMin Cost: {c}")


# ur_sort를 사용한 출력 결과
# [[0, 2, 6, 꼬부기], [0, 1, 10, 피카츄], [0, 3, 5, 이상해씨], [1, 3, 15, 뮤], [2, 3, 4, 파이리], [1, 4, 7, 개굴닌자], [2, 4, 8, 리자몽], [3, 4, 9, 라이츄], [4, 5, 11, 잉어킹], [3, 5, 13, 갸라도스]]
# [[0, 2, 6, 꼬부기], [0, 3, 5, 이상해씨], [0, 1, 10, 피카츄], [1, 3, 15, 뮤], [2, 3, 4, 파이리], [1, 4, 7, 개굴닌자], [2, 4, 8, 리자몽], [3, 4, 9, 라이츄], [4, 5, 11, 잉어킹], [3, 5, 13, 갸라도스]]
# [[0, 2, 6, 꼬부기], [0, 3, 5, 이상해씨], [0, 1, 10, 피카츄], [1, 3, 15, 뮤], [2, 3, 4, 파이리], [1, 4, 7, 개굴닌자], [2, 4, 8, 리자몽], [3, 4, 9, 라이츄], [4, 5, 11, 잉어킹], [3, 5, 13, 갸라도스]]
# [[0, 2, 6, 꼬부기], [0, 3, 5, 이상해씨], [0, 1, 10, 피카츄], [2, 3, 4, 파이리], [1, 3, 15, 뮤], [1, 4, 7, 개굴닌자], [2, 4, 8, 리자몽], [3, 4, 9, 라이츄], [4, 5, 11, 잉어킹], [3, 5, 13, 갸라도스]]
# [[0, 2, 6, 꼬부기], [0, 3, 5, 이상해씨], [0, 1, 10, 피카츄], [2, 3, 4, 파이리], [1, 4, 7, 개굴닌자], [1, 3, 15, 뮤], [2, 4, 8, 리자몽], [3, 4, 9, 라이츄], [4, 5, 11, 잉어킹], [3, 5, 13, 갸라도스]]
# [[0, 2, 6, 꼬부기], [0, 3, 5, 이상해씨], [0, 1, 10, 피카츄], [2, 3, 4, 파이리], [1, 4, 7, 개굴닌자], [2, 4, 8, 리자몽], [1, 3, 15, 뮤], [3, 4, 9, 라이츄], [4, 5, 11, 잉어킹], [3, 5, 13, 갸라도스]]
# [[0, 2, 6, 꼬부기], [0, 3, 5, 이상해씨], [0, 1, 10, 피카츄], [2, 3, 4, 파이리], [1, 4, 7, 개굴닌자], [2, 4, 8, 리자몽], [3, 4, 9, 라이츄], [1, 3, 15, 뮤], [4, 5, 11, 잉어킹], [3, 5, 13, 갸라도스]]
# [[0, 2, 6, 꼬부기], [0, 3, 5, 이상해씨], [0, 1, 10, 피카츄], [2, 3, 4, 파이리], [1, 4, 7, 개굴닌자], [2, 4, 8, 리자몽], [3, 4, 9, 라이츄], [4, 5, 11, 잉어킹], [1, 3, 15, 뮤], [3, 5, 13, 갸라도스]]
# [[0, 2, 6, 꼬부기], [0, 3, 5, 이상해씨], [0, 1, 10, 피카츄], [2, 3, 4, 파이리], [1, 4, 7, 개굴닌자], [2, 4, 8, 리자몽], [3, 4, 9, 라이츄], [4, 5, 11, 잉어킹], [3, 5, 13, 갸라도스], [1, 3, 15, 뮤]]
# [[0, 3, 5, 이상해씨], [0, 2, 6, 꼬부기], [0, 1, 10, 피카츄], [2, 3, 4, 파이리], [1, 4, 7, 개굴닌자], [2, 4, 8, 리자몽], [3, 4, 9, 라이츄], [4, 5, 11, 잉어킹], [3, 5, 13, 갸라도스], [1, 3, 15, 뮤]]
# [[0, 3, 5, 이상해씨], [0, 2, 6, 꼬부기], [0, 1, 10, 피카츄], [2, 3, 4, 파이리], [1, 4, 7, 개굴닌자], [2, 4, 8, 리자몽], [3, 4, 9, 라이츄], [4, 5, 11, 잉어킹], [3, 5, 13, 갸라도스], [1, 3, 15, 뮤]]
# [[0, 3, 5, 이상해씨], [0, 2, 6, 꼬부기], [2, 3, 4, 파이리], [0, 1, 10, 피카츄], [1, 4, 7, 개굴닌자], [2, 4, 8, 리자몽], [3, 4, 9, 라이츄], [4, 5, 11, 잉어킹], [3, 5, 13, 갸라도스], [1, 3, 15, 뮤]]
# [[0, 3, 5, 이상해씨], [0, 2, 6, 꼬부기], [2, 3, 4, 파이리], [1, 4, 7, 개굴닌자], [0, 1, 10, 피카츄], [2, 4, 8, 리자몽], [3, 4, 9, 라이츄], [4, 5, 11, 잉어킹], [3, 5, 13, 갸라도스], [1, 3, 15, 뮤]]
# [[0, 3, 5, 이상해씨], [0, 2, 6, 꼬부기], [2, 3, 4, 파이리], [1, 4, 7, 개굴닌자], [2, 4, 8, 리자몽], [0, 1, 10, 피카츄], [3, 4, 9, 라이츄], [4, 5, 11, 잉어킹], [3, 5, 13, 갸라도스], [1, 3, 15, 뮤]]
# [[0, 3, 5, 이상해씨], [0, 2, 6, 꼬부기], [2, 3, 4, 파이리], [1, 4, 7, 개굴닌자], [2, 4, 8, 리자몽], [3, 4, 9, 라이츄], [0, 1, 10, 피카츄], [4, 5, 11, 잉어킹], [3, 5, 13, 갸라도스], [1, 3, 15, 뮤]]
# [[0, 3, 5, 이상해씨], [0, 2, 6, 꼬부기], [2, 3, 4, 파이리], [1, 4, 7, 개굴닌자], [2, 4, 8, 리자몽], [3, 4, 9, 라이츄], [0, 1, 10, 피카츄], [4, 5, 11, 잉어킹], [3, 5, 13, 갸라도스], [1, 3, 15, 뮤]]
# [[0, 3, 5, 이상해씨], [0, 2, 6, 꼬부기], [2, 3, 4, 파이리], [1, 4, 7, 개굴닌자], [2, 4, 8, 리자몽], [3, 4, 9, 라이츄], [0, 1, 10, 피카츄], [4, 5, 11, 잉어킹], [3, 5, 13, 갸라도스], [1, 3, 15, 뮤]]
# [[0, 3, 5, 이상해씨], [0, 2, 6, 꼬부기], [2, 3, 4, 파이리], [1, 4, 7, 개굴닌자], [2, 4, 8, 리자몽], [3, 4, 9, 라이츄], [0, 1, 10, 피카츄], [4, 5, 11, 잉어킹], [3, 5, 13, 갸라도스], [1, 3, 15, 뮤]]
# [[0, 3, 5, 이상해씨], [2, 3, 4, 파이리], [0, 2, 6, 꼬부기], [1, 4, 7, 개굴닌자], [2, 4, 8, 리자몽], [3, 4, 9, 라이츄], [0, 1, 10, 피카츄], [4, 5, 11, 잉어킹], [3, 5, 13, 갸라도스], [1, 3, 15, 뮤]]
# [[0, 3, 5, 이상해씨], [2, 3, 4, 파이리], [0, 2, 6, 꼬부기], [1, 4, 7, 개굴닌자], [2, 4, 8, 리자몽], [3, 4, 9, 라이츄], [0, 1, 10, 피카츄], [4, 5, 11, 잉어킹], [3, 5, 13, 갸라도스], [1, 3, 15, 뮤]]
# [[0, 3, 5, 이상해씨], [2, 3, 4, 파이리], [0, 2, 6, 꼬부기], [1, 4, 7, 개굴닌자], [2, 4, 8, 리자몽], [3, 4, 9, 라이츄], [0, 1, 10, 피카츄], [4, 5, 11, 잉어킹], [3, 5, 13, 갸라도스], [1, 3, 15, 뮤]]
# [[0, 3, 5, 이상해씨], [2, 3, 4, 파이리], [0, 2, 6, 꼬부기], [1, 4, 7, 개굴닌자], [2, 4, 8, 리자몽], [3, 4, 9, 라이츄], [0, 1, 10, 피카츄], [4, 5, 11, 잉어킹], [3, 5, 13, 갸라도스], [1, 3, 15, 뮤]]
# [[0, 3, 5, 이상해씨], [2, 3, 4, 파이리], [0, 2, 6, 꼬부기], [1, 4, 7, 개굴닌자], [2, 4, 8, 리자몽], [3, 4, 9, 라이츄], [0, 1, 10, 피카츄], [4, 5, 11, 잉어킹], [3, 5, 13, 갸라도스], [1, 3, 15, 뮤]]
# [[0, 3, 5, 이상해씨], [2, 3, 4, 파이리], [0, 2, 6, 꼬부기], [1, 4, 7, 개굴닌자], [2, 4, 8, 리자몽], [3, 4, 9, 라이츄], [0, 1, 10, 피카츄], [4, 5, 11, 잉어킹], [3, 5, 13, 갸라도스], [1, 3, 15, 뮤]]
# [[2, 3, 4, 파이리], [0, 3, 5, 이상해씨], [0, 2, 6, 꼬부기], [1, 4, 7, 개굴닌자], [2, 4, 8, 리자몽], [3, 4, 9, 라이츄], [0, 1, 10, 피카츄], [4, 5, 11, 잉어킹], [3, 5, 13, 갸라도스], [1, 3, 15, 뮤]]
# [[2, 3, 4, 파이리], [0, 3, 5, 이상해씨], [0, 2, 6, 꼬부기], [1, 4, 7, 개굴닌자], [2, 4, 8, 리자몽], [3, 4, 9, 라이츄], [0, 1, 10, 피카츄], [4, 5, 11, 잉어킹], [3, 5, 13, 갸라도스], [1, 3, 15, 뮤]]
# [[2, 3, 4, 파이리], [0, 3, 5, 이상해씨], [0, 2, 6, 꼬부기], [1, 4, 7, 개굴닌자], [2, 4, 8, 리자몽], [3, 4, 9, 라이츄], [0, 1, 10, 피카츄], [4, 5, 11, 잉어킹], [3, 5, 13, 갸라도스], [1, 3, 15, 뮤]]
# [[2, 3, 4, 파이리], [0, 3, 5, 이상해씨], [0, 2, 6, 꼬부기], [1, 4, 7, 개굴닌자], [2, 4, 8, 리자몽], [3, 4, 9, 라이츄], [0, 1, 10, 피카츄], [4, 5, 11, 잉어킹], [3, 5, 13, 갸라도스], [1, 3, 15, 뮤]]
# [[2, 3, 4, 파이리], [0, 3, 5, 이상해씨], [0, 2, 6, 꼬부기], [1, 4, 7, 개굴닌자], [2, 4, 8, 리자몽], [3, 4, 9, 라이츄], [0, 1, 10, 피카츄], [4, 5, 11, 잉어킹], [3, 5, 13, 갸라도스], [1, 3, 15, 뮤]]
# [[2, 3, 4, 파이리], [0, 3, 5, 이상해씨], [0, 2, 6, 꼬부기], [1, 4, 7, 개굴닌자], [2, 4, 8, 리자몽], [3, 4, 9, 라이츄], [0, 1, 10, 피카츄], [4, 5, 11, 잉어킹], [3, 5, 13, 갸라도스], [1, 3, 15, 뮤]]
# [[2, 3, 4, 파이리], [0, 3, 5, 이상해씨], [0, 2, 6, 꼬부기], [1, 4, 7, 개굴닌자], [2, 4, 8, 리자몽], [3, 4, 9, 라이츄], [0, 1, 10, 피카츄], [4, 5, 11, 잉어킹], [3, 5, 13, 갸라도스], [1, 3, 15, 뮤]]
# [[2, 3, 4, 파이리], [0, 3, 5, 이상해씨], [0, 2, 6, 꼬부기], [1, 4, 7, 개굴닌자], [2, 4, 8, 리자몽], [3, 4, 9, 라이츄], [0, 1, 10, 피카츄], [4, 5, 11, 잉어킹], [3, 5, 13, 갸라도스], [1, 3, 15, 뮤]]
# [[2, 3, 4, 파이리], [0, 3, 5, 이상해씨], [0, 2, 6, 꼬부기], [1, 4, 7, 개굴닌자], [2, 4, 8, 리자몽], [3, 4, 9, 라이츄], [0, 1, 10, 피카츄], [4, 5, 11, 잉어킹], [3, 5, 13, 갸라도스], [1, 3, 15, 뮤]]
# [[2, 3, 4, 파이리], [0, 3, 5, 이상해씨], [0, 2, 6, 꼬부기], [1, 4, 7, 개굴닌자], [2, 4, 8, 리자몽], [3, 4, 9, 라이츄], [0, 1, 10, 피카츄], [4, 5, 11, 잉어킹], [3, 5, 13, 갸라도스], [1, 3, 15, 뮤]]
# [[2, 3, 4, 파이리], [0, 3, 5, 이상해씨], [0, 2, 6, 꼬부기], [1, 4, 7, 개굴닌자], [2, 4, 8, 리자몽], [3, 4, 9, 라이츄], [0, 1, 10, 피카츄], [4, 5, 11, 잉어킹], [3, 5, 13, 갸라도스], [1, 3, 15, 뮤]]
# [[2, 3, 4, 파이리], [0, 3, 5, 이상해씨], [0, 2, 6, 꼬부기], [1, 4, 7, 개굴닌자], [2, 4, 8, 리자몽], [3, 4, 9, 라이츄], [0, 1, 10, 피카츄], [4, 5, 11, 잉어킹], [3, 5, 13, 갸라도스], [1, 3, 15, 뮤]]
# [[2, 3, 4, 파이리], [0, 3, 5, 이상해씨], [0, 2, 6, 꼬부기], [1, 4, 7, 개굴닌자], [2, 4, 8, 리자몽], [3, 4, 9, 라이츄], [0, 1, 10, 피카츄], [4, 5, 11, 잉어킹], [3, 5, 13, 갸라도스], [1, 3, 15, 뮤]]
# [[2, 3, 4, 파이리], [0, 3, 5, 이상해씨], [0, 2, 6, 꼬부기], [1, 4, 7, 개굴닌자], [2, 4, 8, 리자몽], [3, 4, 9, 라이츄], [0, 1, 10, 피카츄], [4, 5, 11, 잉어킹], [3, 5, 13, 갸라도스], [1, 3, 15, 뮤]]
# [[2, 3, 4, 파이리], [0, 3, 5, 이상해씨], [0, 2, 6, 꼬부기], [1, 4, 7, 개굴닌자], [2, 4, 8, 리자몽], [3, 4, 9, 라이츄], [0, 1, 10, 피카츄], [4, 5, 11, 잉어킹], [3, 5, 13, 갸라도스], [1, 3, 15, 뮤]]
# [[2, 3, 4, 파이리], [0, 3, 5, 이상해씨], [0, 2, 6, 꼬부기], [1, 4, 7, 개굴닌자], [2, 4, 8, 리자몽], [3, 4, 9, 라이츄], [0, 1, 10, 피카츄], [4, 5, 11, 잉어킹], [3, 5, 13, 갸라도스], [1, 3, 15, 뮤]]
# [[2, 3, 4, 파이리], [0, 3, 5, 이상해씨], [0, 2, 6, 꼬부기], [1, 4, 7, 개굴닌자], [2, 4, 8, 리자몽], [3, 4, 9, 라이츄], [0, 1, 10, 피카츄], [4, 5, 11, 잉어킹], [3, 5, 13, 갸라도스], [1, 3, 15, 뮤]]
# [[2, 3, 4, 파이리], [0, 3, 5, 이상해씨], [0, 2, 6, 꼬부기], [1, 4, 7, 개굴닌자], [2, 4, 8, 리자몽], [3, 4, 9, 라이츄], [0, 1, 10, 피카츄], [4, 5, 11, 잉어킹], [3, 5, 13, 갸라도스], [1, 3, 15, 뮤]]
# [[2, 3, 4, 파이리], [0, 3, 5, 이상해씨], [0, 2, 6, 꼬부기], [1, 4, 7, 개굴닌자], [2, 4, 8, 리자몽], [3, 4, 9, 라이츄], [0, 1, 10, 피카츄], [4, 5, 11, 잉어킹], [3, 5, 13, 갸라도스], [1, 3, 15, 뮤]]
# [[2, 3, 4, 파이리], [0, 3, 5, 이상해씨], [0, 2, 6, 꼬부기], [1, 4, 7, 개굴닌자], [2, 4, 8, 리자몽], [3, 4, 9, 라이츄], [0, 1, 10, 피카츄], [4, 5, 11, 잉어킹], [3, 5, 13, 갸라도스], [1, 3, 15, 뮤]]
# [[2, 3, 4, 파이리], [0, 3, 5, 이상해씨], [0, 2, 6, 꼬부기], [1, 4, 7, 개굴닌자], [2, 4, 8, 리자몽], [3, 4, 9, 라이츄], [0, 1, 10, 피카츄], [4, 5, 11, 잉어킹], [3, 5, 13, 갸라도스], [1, 3, 15, 뮤]]
# 정렬 시간 : 0.0020241737365722656초
# [[2, 3, 4, 파이리], [0, 3, 5, 이상해씨], [0, 2, 6, 꼬부기], [1, 4, 7, 개굴닌자], [2, 4, 8, 리자몽], [3, 4, 9, 라이츄], [0, 1, 10, 피카츄], [4, 5, 11, 잉어킹], [3, 5, 13, 갸라도스], [1, 3, 15, 뮤]]
# MST: [[2, 3, 4, 파이리], [0, 3, 5, 이상해씨], [1, 4, 7, 개굴닌자], [2, 4, 8, 리자몽], [4, 5, 11, 잉어킹]]
# Min Cost: 35



# my_sort를 사용한 출력 결과
# [[0, 2, 6, 꼬부기], [0, 3, 5, 이상해씨], [2, 3, 4, 파이리]] [[1, 4, 7, 개굴닌자]] [[0, 1, 10, 피카츄], [1, 3, 15, 뮤], [2, 4, 8, 리자몽], [3, 4, 9, 라이츄], [4, 5, 11, 잉어킹], [3, 5, 13, 갸라도스]]
# [[2, 3, 4, 파이리]] [[0, 3, 5, 이상해씨]] [[0, 2, 6, 꼬부기]]
# [[2, 4, 8, 리자몽]] [[3, 4, 9, 라이츄]] [[0, 1, 10, 피카츄], [1, 3, 15, 뮤], [4, 5, 11, 잉어킹], [3, 5, 13, 갸라도스]]
# [[0, 1, 10, 피카츄]] [[4, 5, 11, 잉어킹]] [[1, 3, 15, 뮤], [3, 5, 13, 갸라도스]]
# [] [[3, 5, 13, 갸라도스]] [[1, 3, 15, 뮤]]
# 정렬 시간 : 0.0초
# [[2, 3, 4, 파이리], [0, 3, 5, 이상해씨], [0, 2, 6, 꼬부기], [1, 4, 7, 개굴닌자], [2, 4, 8, 리자몽], [3, 4, 9, 라이츄], [0, 1, 10, 피카츄], [4, 5, 11, 잉어킹], [3, 5, 13, 갸라도스], [1, 3, 15, 뮤]]
# MST: [[2, 3, 4, 파이리], [0, 3, 5, 이상해씨], [1, 4, 7, 개굴닌자], [2, 4, 8, 리자몽], [4, 5, 11, 잉어킹]]
# Min Cost: 35